# (c) Georgii Semenov / MrGeorgeous 2021
# Декодер текста

import sys
if len(sys.argv) < 2:
    print("Specify the filename as command line argument.")
    exit(1)

fn = sys.argv[1]

d = dict()
d['0'] = 'а'
d['1'] = 'б'
d['2'] = 'в'
d['3'] = 'г'
d['4'] = 'д'
d['5'] = 'е'
d['6'] = 'ж'
d['7'] = 'з'
d['8'] = 'и'
d['9'] = 'й'
d[':'] = 'к'
d[';'] = 'л'
d['<'] = 'м'
d['='] = 'н'
d['>'] = 'о'
d['?'] = 'п'
d['@'] = 'р'
d['A'] = 'с'
d['B'] = 'т'
d['C'] = 'у'
d['D'] = 'ф'
d['E'] = 'х'
d['F'] = 'ц'
d['G'] = 'ч'
d['H'] = 'ш'
d['I'] = 'щ'
d['J'] = 'ъ'
d['K'] = 'ы'
d['L'] = 'ь'
d['M'] = 'э'
d['N'] = 'ю'
d['O'] = 'я'

# d[''] = 'А'
# d[''] = 'Б'
# d[''] = 'В'
# d[''] = 'Г'
# d[''] = 'Д'
# d[''] = 'Е'
# d[''] = 'Ж'
# d[''] = 'З'
# d[''] = 'И'
# d[''] = 'Й'
# d[''] = 'К'
# d[''] = 'Л'
# d[''] = 'М'
# d[''] = 'Н'
# d[''] = 'О'
# d[''] = 'П'
# d[''] = 'Р'
# d['!'] = 'С'
# d[''] = 'Т'
# d[''] = 'У'
# d[''] = 'Ф'
# d[''] = 'Х'
# d[''] = 'Ц'
# d[''] = 'Ч'
# d[''] = 'Ш'
# d[''] = 'Щ'
# d[''] = 'Ъ'
# d[''] = 'Ы'
# d[''] = 'Ь'
# d[''] = 'Э'
# d['.'] = 'Ю'
# d[''] = 'Я'
# d[''] = ''

with open(fn) as f:
    s = f.read()
    s = s.replace("  ", " ")

    for k in d:
        if k != '' :
            s = s.replace(" " + k, d[k])

    print(s)
    exit(0)

print("File could not be found or read.")
exit(1)